'use client'

import ExternalLink from '../ExternalLink'

export default function MicrosoftDetails() {
  return (
    <>
      <p>
        全国の18歳から25歳までの人を対象としたプログラムで、選ばれた18名が
        シアトルで3週間リーダーシップに関する研修を受け、
        帰国後はマイクロソフトの支援を受けながら参加者それぞれのプロジェクトに取り組みました。
      </p>
      <ExternalLink href="https://usjapantomodachi.org/ja/2018/02/24346/">
        プログラムの詳細
      </ExternalLink>
      <p>
        私は自分自身の経験から、「若者の自殺を防ぐ」というプロジェクトに取り組みました。
        プログラムで訪れたシアトルはよく晴れていて素敵な場所だと思いましたが、
        「夏以外は晴れることが少ない。自殺する人が多く、天気も少なからず影響しているだろう」
        というお話を聞けました。
      </p>
      <p>
        プログラムのメンターの一人に精神科医がいらっしゃったので相談したところ、
        何をする場合でも守秘義務はとても重要であることを教えていただきました。
      </p>
      <p>
        帰国後は悩んでいる若者を対象にオンラインで相談に乗っていましたが、
        精神科医ではないただの大学生にできることは限られており、力不足を痛感しました。
      </p>
      <p>
        まずは力をつけなければいけないと思い、
        情報科学の学科に所属していたので、
        プログラム後はアプリを作って専門性を高めました。
      </p>
    </>
  )
}
